In [1]:
import pandas as pd

In [2]:
data = {
    'nombre': ['hugo', 'paco', 'luis'],
    'edad': [21, 18, 23],
    'email': ['hugo@uwu.com', 'paco@owo.net', 'luis@salu2.io']
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  nombre  edad          email
0   hugo    21   hugo@uwu.com
1   paco    18   paco@owo.net
2   luis    23  luis@salu2.io

In [5]:
data = [
    {'nombre':'hugo', 'edad':21, 'email': 'hugo@uwu.com'},
    {'nombre':'paco', 'edad':18, 'email': 'paco@owo.net'},
    {'nombre':'luis', 'edad':23, 'email': 'luis@salu2.io'}
]

In [6]:
pd.DataFrame(data)

  nombre  edad          email
0   hugo    21   hugo@uwu.com
1   paco    18   paco@owo.net
2   luis    23  luis@salu2.io